token = "1759782968:AAGAANpRql28Uv6qPboSY9JHYnH9IRgiECM"
headers = {'User-Agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/89.0.4389.128 Safari/537.36'}
info_message = "Привет! Этот бот создан, чтобы помочь тебе не пропускать выгодные объявления на Avito.\nКоманды:" \
               "\n\n/new - задать боту ссылку, по которой будут проверяться объявления\n\n/parse - начать мониторинг " \
               "объявлений\n\n/stop - закончить мониторинг\n\nТак как бот создан школьником, то наличие багов в нём" \
               " почти гарантировано. Если вы встретили один из них, напишите @smalyarovsky."

parse_message = "Мониторинг запущен. Если бот найдет что-то, он сразу напишет тебе"
end_message = "Мониторинг остановлен. Больше уведомления о новых объявлениях приходить не будут"
end_without_start_message = "Мониторинг сейчас не запущен."
new_message = "Задайте на Avito все нужные вам параметры, скопируйте ссылку из бразера и пришлите сюда." \
              "\n\n*Внимание!* Если ввести некорректный адрес, бот возможно сломается. Мне лень было над этим думать," \
              "  так что, пожалуйста, провертье - правильно ли вы скопировали адрес."
got_a_link_message = "Бот сохранил вашу ссылку."
got_a_link_to_parse_message = "Бот сохранил вашу ссылку и запустил мониторинг. Если он найдет что-то, " \
                              "он сразу напишет тебе"
parse_without_link_message = "Вы еще не сохранили ссылку по которой будут проверяться объявления. Задайте на Avito " \
                             "все нужные вам параметры, скопируйте ссылку из бразера и пришлите сюда.\n\n*Внимание!* " \
                             "Если ввести некорректный адрес, бот возможно сломается. Мне лень было над этим думать, " \
                             "так, пожалуйста, проверьте - правильно ли вы скопировали адрес."
parse_when_parsing_message = "Мониторинг уже запущен."
url = ""